/**
 * 省市二级联动插件
 * Date: 2012-11-15
 * Version: 0.1
 */
!function(window, undefined){

  CTK = window.CTK || {};

  CTK.ProvinceCity = function(options){
    this.options = $.extend({}, CTK.ProvinceCity.defaults, options);
    this.cityData = CTK.ProvinceCity.cityData;
    this.init();
  }

  CTK.ProvinceCity.prototype = {
    init: function(){
      var me = this
        , $region = $(this.options.firstSel)
        , $city = $(this.options.secondSel)
        , regionHtml = []
        , cityHtml = [];

      regionHtml.push('<option value="0">' + me.options.defaultData[0] + '</option>');

      $.each(me.cityData.region, function(i, value){
        regionHtml.push('<option value="'+ value + '">' + value + '</option>');
      });

      $region.append(regionHtml.join(''));

      $region.change(function(){
        var index = this.selectedIndex - 1;
        $.each(me.cityData.city[index], function(i, value){
          cityHtml.push('<option value="'+ value + '">' + value + '</option>');
        });
        $city.html(cityHtml.join(''));
        cityHtml = [];
      });
    }
  }

  CTK.ProvinceCity.defaults = {
    firstSel: '[data-ctv="region"]',
    secondSel: '[data-ctv="city"]',
    defaultData: ['选择地区', '选择城市']
  }

  CTK.ProvinceCity.cityData = {
    // 省、直辖市
    region: ['北京市', '上海市', '天津市', '重庆市', '河北省', '山西省', '内蒙古自治区', '辽宁省', '吉林省', '黑龙江', '江苏省', '浙江省', '安徽省', '福建省', '江西省', '山东省', '河南省', '湖北省', '湖南省', '广东省', '广西自治区', '海南省', '四川省', '贵州省', '云南省', '西藏自治区', '陕西省', '甘肃省', '青海省', '宁夏自治区', '新疆自治区', '香港特别行政区', '澳门特别行政区', '台湾省'],
    // 市
    city: [
      ['东城', '西城', '崇文', '宣武', '朝阳', '丰台', '石景山', '海淀', '门头沟', '房山', '通州', '顺义', '昌平', '大兴', '平谷', '怀柔', '密云', '延庆'],
      ['黄浦', '卢湾', '徐汇', '长宁', '静安', '普陀', '闸北', '虹口', '杨浦', '闵行', '宝山', '嘉定', '浦东', '金山', '松江', '青浦', '南汇', '奉贤', '崇明'],
      ['和平', '东丽', '河东', '西青', '河西', '津南', '南开', '北辰', '河北', '武清', '红挢', '塘沽', '汉沽', '大港', '宁河', '静海', '宝坻', '蓟县'],
      ['万州', '涪陵', '渝中', '大渡口', '江北', '沙坪坝', '九龙坡', '南岸', '北碚', '万盛', '双挢', '渝北', '巴南', '黔江', '长寿', '綦江', '潼南', '铜梁', '大足', '荣昌', '壁山', '梁平', '城口', '丰都', '垫江', '武隆', '忠县', '开县', '云阳', '奉节', '巫山', '巫溪', '石柱', '秀山', '酉阳', '彭水', '江津', '合川', '永川', '南川'],
      //华北地区
      ['石家庄','唐山','秦皇岛','邯郸','邢台','保定','张家口','承德','沧州','廊坊','衡水'],
      ['太原','大同','阳泉','长治','晋城','朔州','晋中','运城','忻州','临汾','吕梁'],
      ['呼和浩特','包头','乌海','赤峰','通辽','鄂尔多斯','呼伦贝尔','巴彦淖尔','乌兰察布','兴安','锡林郭勒','阿拉善'],
      //东北地区
      ['沈阳','大连','鞍山','抚顺','本溪','丹东','锦州','营口','阜新','辽阳','盘锦','铁岭','朝阳','葫芦岛'],
      ['长春','吉林','四平','辽源','通化','白山','松原','白城','延边'],
      ['哈尔滨','齐齐哈尔','鸡西','鹤岗','双鸭山','大庆','伊春','佳木斯','七台河','牡丹江','黑河','绥化','大兴安岭'],
      //华东地区
      ['南京','无锡','徐州','常州','苏州','南通','连云港','淮安','盐城','扬州','镇江','泰州','宿迁'],
      ['杭州','宁波','温州','嘉兴','湖州','绍兴','金华','衢州','舟山','台州','丽水'],
      ['合肥','芜湖','蚌埠','淮南','马鞍山','淮北','铜陵','安庆','黄山','滁州','阜阳','宿州','巢湖','六安','亳州','池州','宣城'],
      ['福州','厦门','莆田','三明','泉州','漳州','南平','龙岩','宁德'],
      ['南昌','景德镇','萍乡','九江','新余','鹰潭','赣州','吉安','宜春','抚州','上饶'],
      ['济南','青岛','淄博','枣庄','东营','烟台','潍坊','威海','济宁','泰安','日照','莱芜','临沂','德州','聊城','滨州','菏泽'],
      //中南地区
      ['郑州','开封','洛阳','平顶山','焦作','鹤壁','新乡','安阳','濮阳','许昌','漯河','三门峡','南阳','商丘','信阳','周口','驻马店'],
      ['武汉','黄石','襄樊','十堰','荆州','宜昌','荆门','鄂州','孝感','咸宁','随州','恩施'],
      ['长沙','株洲','湘潭','衡阳','邵阳','岳阳','常德','张家界','益阳','郴州','永州','怀化','娄底','湘西'],
      ['广州','深圳','珠海','汕头','韶关','佛山','江门','湛江','茂名','肇庆','惠州','梅州','汕尾','河源','阳江','清远','东莞','中山','潮州','揭阳','云浮'],
      ['南宁','柳州','桂林','梧州','北海','防城港','钦州','贵港','玉林','百色','贺州','河池','来宾','崇左'],
      ['海口','三亚'],
      //西南地区
      ['成都','自贡','攀枝花','泸州','德阳','绵阳','广元','遂宁','内江','乐山','南充','宜宾','广安','达州','眉山','雅安','巴中','资阳','阿坝','甘孜','凉山'],
      ['贵阳','六盘水','遵义','安顺','铜仁','毕节','黔西南','黔东南','黔南'],
      ['昆明','曲靖','玉溪','保山','昭通','丽江','普洱','临沧','文山','红河','西双版纳','楚雄','大理','德宏','怒江','迪庆'],
      ['拉萨','昌都','山南','日喀则','那曲','阿里','林芝'],
      //西北地区
      ['西安','铜川','宝鸡','咸阳','渭南','延安','汉中','榆林','安康','商洛'],
      ['兰州','嘉峪关','金昌','白银','天水','武威','张掖','平凉','酒泉','庆阳','定西','陇南','临夏','甘南'],
      ['西宁','海东','海北','黄南','海南','果洛','玉树','海西'],
      ['银川','石嘴山','吴忠','固原','中卫'],
      ['乌鲁木齐','克拉玛依','吐鲁番','哈密','和田','阿克苏','喀什','克孜勒苏柯尔克孜','巴音郭楞蒙古','昌吉','博尔塔拉蒙古','伊犁哈萨克','塔城','阿勒泰'],
      //港澳台
      ['香港特别行政区'],
      ['澳门特别行政区'],
      ['台北','高雄','基隆','台中','台南','新竹','嘉义']
    ]
  }

  window.CTK = CTK;

  $(function(){
    new CTK.ProvinceCity();
  });

}(window);